// ЗАДАЧА 1
// БАЗОВІ ОПЕРАЦІЇ З МАСИВОМ
// 1)створіть масив styles з елементами «Джаз» і «Блюз»
// 2)добавте «Рок-н-ролл» в кінець
// 3)замініть значення в середині на «Классика»
// 4)видаліть перший елемент і виведіть його в консоль
// 5)вставте «Рэп» і «Регги» на початок масиву

// МАСИВ ПО ХОДІ ВИПОВНЕННЯ ОПЕРАЦІЇ
// // Джаз, Блюз
// // Джаз, Блюз, 
// // Джаз, Классика, Рок-н-ролл
// // Классика, Рок-н-ролл
// // Рэп, Регги, Классика, Рок-н-ролл

// const styles = ["Джаз" ,"Блюз"];
// styles.push("Рок-н-ролл");
// styles.slice(1,1,"Классика");
// styles.shift();
// styles.unshift("Рєп", "регги" );
// console.log(styles);


// ЗАДАЧА 2
// використовуючи цикл for , який для кожного елемента масива буде виводити в консоль 
// повідомлення у форматі <індекс елемента> та <значення елемента>.
// Номерація для кожного елемента масива [] з індексом 0 буде виведено 1 - Mango, а для индекса 2 виедет 3 - Ajax.

function indexElement () {
    let indexes = ['Mango', 'Poly', 'Ajax' ];
    for( const index of indexes) {
        console.log(`${indexes.indexOf(index)} + ${ index }`);
    }
}
indexElement ();